AlmAck/svdtonuttx/demo/h/da1470x_qspic.h
/****************************************************************************
 * ./tmp/da1470x_qspic.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470X_QSPIC_H
#define __DA1470X_QSPIC_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "da1470x_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define DA1470X_QSPIC_QSPIC_AWRITECMD_OFFSET  0x0040 /* The way of writing in Auto mode when the external device is a serial SRAM */
#define DA1470X_QSPIC_QSPIC_BURSTBRK_OFFSET   0x0030 /* Read break sequence in Auto mode */
#define DA1470X_QSPIC_QSPIC_BURSTCMDA_OFFSET  0x000C /* The way of reading in Auto mode (command register A) */
#define DA1470X_QSPIC_QSPIC_BURSTCMDB_OFFSET  0x0010 /* The way of reading in Auto mode (command register B) */
#define DA1470X_QSPIC_QSPIC_CHCKERASE_OFFSET  0x0038 /* Check erase progress in Auto mode */
#define DA1470X_QSPIC_QSPIC_CTRLBUS_OFFSET    0x0000 /* SPI Bus control register for the Manual mode */
#define DA1470X_QSPIC_QSPIC_CTRLMODE_OFFSET   0x0004 /* Mode control register */
#define DA1470X_QSPIC_QSPIC_DUMMYDATA_OFFSET  0x0020 /* Send dummy clocks to SPI Bus for the Manual mode */
#define DA1470X_QSPIC_QSPIC_ERASECMDA_OFFSET  0x0028 /* The way of erasing in Auto mode (command register A) */
#define DA1470X_QSPIC_QSPIC_ERASECMDB_OFFSET  0x002C /* The way of erasing in Auto mode (command register B) */
#define DA1470X_QSPIC_QSPIC_ERASECTRL_OFFSET  0x0024 /* Erase control register */
#define DA1470X_QSPIC_QSPIC_GP_OFFSET         0x003C /* General purpose QSPIC register */
#define DA1470X_QSPIC_QSPIC_MEMBLEN_OFFSET    0x0044 /* External memory burst length configuration */
#define DA1470X_QSPIC_QSPIC_READDATA_OFFSET   0x001C /* Read data from SPI Bus for the Manual mode */
#define DA1470X_QSPIC_QSPIC_RECVDATA_OFFSET   0x0008 /* Received data for the Manual mode */
#define DA1470X_QSPIC_QSPIC_STATUSCMD_OFFSET  0x0034 /* The way of reading the status of external device in Auto mode */
#define DA1470X_QSPIC_QSPIC_STATUS_OFFSET     0x0014 /* The status register of the QSPI controller */
#define DA1470X_QSPIC_QSPIC_WRITEDATA_OFFSET  0x0018 /* Write data to SPI Bus for the Manual mode */

/* Register addresses *******************************************************/

#define DA1470X_QSPIC_BASE                    0x46000000 /* QSPIC registers */

#define DA1470X_QSPIC_QSPIC_AWRITECMD         (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_AWRITECMD_OFFSET) /* The way of writing in Auto mode when the external device is a serial SRAM */
#define DA1470X_QSPIC_QSPIC_BURSTBRK          (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_BURSTBRK_OFFSET) /* Read break sequence in Auto mode */
#define DA1470X_QSPIC_QSPIC_BURSTCMDA         (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_BURSTCMDA_OFFSET) /* The way of reading in Auto mode (command register A) */
#define DA1470X_QSPIC_QSPIC_BURSTCMDB         (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_BURSTCMDB_OFFSET) /* The way of reading in Auto mode (command register B) */
#define DA1470X_QSPIC_QSPIC_CHCKERASE         (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_CHCKERASE_OFFSET) /* Check erase progress in Auto mode */
#define DA1470X_QSPIC_QSPIC_CTRLBUS           (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_CTRLBUS_OFFSET) /* SPI Bus control register for the Manual mode */
#define DA1470X_QSPIC_QSPIC_CTRLMODE          (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_CTRLMODE_OFFSET) /* Mode control register */
#define DA1470X_QSPIC_QSPIC_DUMMYDATA         (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_DUMMYDATA_OFFSET) /* Send dummy clocks to SPI Bus for the Manual mode */
#define DA1470X_QSPIC_QSPIC_ERASECMDA         (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_ERASECMDA_OFFSET) /* The way of erasing in Auto mode (command register A) */
#define DA1470X_QSPIC_QSPIC_ERASECMDB         (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_ERASECMDB_OFFSET) /* The way of erasing in Auto mode (command register B) */
#define DA1470X_QSPIC_QSPIC_ERASECTRL         (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_ERASECTRL_OFFSET) /* Erase control register */
#define DA1470X_QSPIC_QSPIC_GP                (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_GP_OFFSET) /* General purpose QSPIC register */
#define DA1470X_QSPIC_QSPIC_MEMBLEN           (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_MEMBLEN_OFFSET) /* External memory burst length configuration */
#define DA1470X_QSPIC_QSPIC_READDATA          (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_READDATA_OFFSET) /* Read data from SPI Bus for the Manual mode */
#define DA1470X_QSPIC_QSPIC_RECVDATA          (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_RECVDATA_OFFSET) /* Received data for the Manual mode */
#define DA1470X_QSPIC_QSPIC_STATUSCMD         (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_STATUSCMD_OFFSET) /* The way of reading the status of external device in Auto mode */
#define DA1470X_QSPIC_QSPIC_STATUS            (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_STATUS_OFFSET) /* The status register of the QSPI controller */
#define DA1470X_QSPIC_QSPIC_WRITEDATA         (DA1470X_QSPIC_BASE + DA1470X_QSPIC_QSPIC_WRITEDATA_OFFSET) /* Write data to SPI Bus for the Manual mode */

/* Register bit definitions *************************************************/


/* QSPIC_AWRITECMD Register */

#define QSPIC_QSPIC_WR_CS_HIGH_MIN_MASK       (0x1F << 14) /* After the execution of the write command, the QSPI_CS remains high for at least  */
#define QSPIC_QSPIC_WR_CS_HIGH_MIN_POS        (14) /* After the execution of the write command, the QSPI_CS remains high for at least  */
#define QSPIC_QSPIC_WR_DAT_TX_MD_MASK         (0x3 << 12) /* The mode of the SPI Bus during the data phase of the write command. 0x0: Single  */
#define QSPIC_QSPIC_WR_DAT_TX_MD_POS          (12) /* The mode of the SPI Bus during the data phase of the write command. 0x0: Single  */
#define QSPIC_QSPIC_WR_ADR_TX_MD_MASK         (0x3 << 10) /* The mode of the SPI Bus during the adress phase of the write command. 0x0: Singl */
#define QSPIC_QSPIC_WR_ADR_TX_MD_POS          (10) /* The mode of the SPI Bus during the adress phase of the write command. 0x0: Singl */
#define QSPIC_QSPIC_WR_INST_TX_MD_MASK        (0x3 << 8) /* The mode of the SPI Bus during the instruction phase of the write command. 0x0:  */
#define QSPIC_QSPIC_WR_INST_TX_MD_POS         (8) /* The mode of the SPI Bus during the instruction phase of the write command. 0x0:  */
#define QSPIC_QSPIC_WR_INST_MASK              (0xFF << 0) /* This is the value of the instruction that is used, in order to be programmed the */
#define QSPIC_QSPIC_WR_INST_POS               (0) /* This is the value of the instruction that is used, in order to be programmed the */

/* QSPIC_BURSTBRK Register */

#define QSPIC_QSPIC_SEC_HF_DS                 (1U << 20) /* Disable output during the transmission of the second half (QSPIC_BRK_WRD[3:0]).  */
#define QSPIC_QSPIC_BRK_TX_MD_MASK            (0x3 << 18) /* The mode of the SPI Bus during the transmission of the read break sequence. 0x0: */
#define QSPIC_QSPIC_BRK_TX_MD_POS             (18) /* The mode of the SPI Bus during the transmission of the read break sequence. 0x0: */
#define QSPIC_QSPIC_BRK_SZ                    (1U << 17) /* The size of the read break sequence. 0: One byte (Send QSPIC_BRK_WRD[15:8]) 1: T */
#define QSPIC_QSPIC_BRK_EN                    (1U << 16) /* Controls the application of a special command (read break sequence) that is used */
#define QSPIC_QSPIC_BRK_WRD_MASK              (0xFFFF << 0) /* This is the value of a special command (read break sequence) that is applied by  */
#define QSPIC_QSPIC_BRK_WRD_POS               (0) /* This is the value of a special command (read break sequence) that is applied by  */

/* QSPIC_BURSTCMDA Register */

#define QSPIC_QSPIC_DMY_TX_MD_MASK            (0x3 << 30) /* It describes the mode of the SPI bus during the Dummy bytes phase. 0x0: Single S */
#define QSPIC_QSPIC_DMY_TX_MD_POS             (30) /* It describes the mode of the SPI bus during the Dummy bytes phase. 0x0: Single S */
#define QSPIC_QSPIC_EXT_TX_MD_MASK            (0x3 << 28) /* It describes the mode of the SPI bus during the Extra Byte phase. 0x0: Single SP */
#define QSPIC_QSPIC_EXT_TX_MD_POS             (28) /* It describes the mode of the SPI bus during the Extra Byte phase. 0x0: Single SP */
#define QSPIC_QSPIC_ADR_TX_MD_MASK            (0x3 << 26) /* It describes the mode of the SPI bus during the address phase. 0x0: Single SPI 0 */
#define QSPIC_QSPIC_ADR_TX_MD_POS             (26) /* It describes the mode of the SPI bus during the address phase. 0x0: Single SPI 0 */
#define QSPIC_QSPIC_INST_TX_MD_MASK           (0x3 << 24) /* It describes the mode of the SPI bus during the instruction phase. 0x0: Single S */
#define QSPIC_QSPIC_INST_TX_MD_POS            (24) /* It describes the mode of the SPI bus during the instruction phase. 0x0: Single S */
#define QSPIC_QSPIC_EXT_BYTE_MASK             (0xFF << 16) /* The value of an extra byte which will be transferred after address (only if QSPI */
#define QSPIC_QSPIC_EXT_BYTE_POS              (16) /* The value of an extra byte which will be transferred after address (only if QSPI */
#define QSPIC_QSPIC_INST_WB_MASK              (0xFF << 8) /* Instruction Value for Wrapping Burst. This value is the selected instruction whe */
#define QSPIC_QSPIC_INST_WB_POS               (8) /* Instruction Value for Wrapping Burst. This value is the selected instruction whe */
#define QSPIC_QSPIC_INST_MASK                 (0xFF << 0) /* Instruction Value for Incremental Burst or Single read access. This value is the */
#define QSPIC_QSPIC_INST_POS                  (0) /* Instruction Value for Incremental Burst or Single read access. This value is the */

/* QSPIC_BURSTCMDB Register */

#define QSPIC_QSPIC_DMY_FORCE                 (1U << 15) /* By setting this bit, the number of dummy bytes is forced to be equal to 3. In th */
#define QSPIC_QSPIC_CS_HIGH_MIN_MASK          (0x7 << 12) /* Between the transmission of two different instructions to the flash memory, the  */
#define QSPIC_QSPIC_CS_HIGH_MIN_POS           (12) /* Between the transmission of two different instructions to the flash memory, the  */
#define QSPIC_QSPIC_WRAP_SIZE_MASK            (0x3 << 10) /* It describes the selected data size of a wrapping burst (QSPIC_WRAP_MD). 0x0: By */
#define QSPIC_QSPIC_WRAP_SIZE_POS             (10) /* It describes the selected data size of a wrapping burst (QSPIC_WRAP_MD). 0x0: By */
#define QSPIC_QSPIC_WRAP_LEN_MASK             (0x3 << 8) /* It describes the selected length of a wrapping burst (QSPIC_WRAP_MD). 0x0: 4 bea */
#define QSPIC_QSPIC_WRAP_LEN_POS              (8) /* It describes the selected length of a wrapping burst (QSPIC_WRAP_MD). 0x0: 4 bea */
#define QSPIC_QSPIC_WRAP_MD                   (1U << 7) /* Wrap mode 0: The QSPIC_INST is the selected instruction at any access. 1: The QS */
#define QSPIC_QSPIC_INST_MD                   (1U << 6) /* Instruction mode 0: Transmit instruction at any burst access. 1: Transmit instru */
#define QSPIC_QSPIC_DMY_NUM_MASK              (0x3 << 4) /* Number of Dummy Bytes  0x0: Zero Dummy Bytes (Don't Send Dummy Bytes) 0x1: Send  */
#define QSPIC_QSPIC_DMY_NUM_POS               (4) /* Number of Dummy Bytes  0x0: Zero Dummy Bytes (Don't Send Dummy Bytes) 0x1: Send  */
#define QSPIC_QSPIC_EXT_HF_DS                 (1U << 3) /* Extra Half Disable Output 0: if QSPIC_EXT_BYTE_EN=1 then transmit the complete Q */
#define QSPIC_QSPIC_EXT_BYTE_EN               (1U << 2) /* Extra Byte Enable 0: Don't Send QSPIC_EXT_BYTE 1: Send QSPIC_EXT_BYTE */
#define QSPIC_QSPIC_DAT_RX_MD_MASK            (0x3 << 0) /* It describes the mode of the SPI bus during the data phase. 0x0: Single SPI 0x1: */
#define QSPIC_QSPIC_DAT_RX_MD_POS             (0) /* It describes the mode of the SPI bus during the data phase. 0x0: Single SPI 0x1: */

