AlmAck/svdtonuttx/demo/h/da1470x_qspic.h
/* QSPIC_CHCKERASE Register */

#define QSPIC_QSPIC_CHCKERASE_MASK            (0xFFFFFFFF << 0) /* Writing any value to this register during erasing, forces the controller to read */
#define QSPIC_QSPIC_CHCKERASE_POS             (0) /* Writing any value to this register during erasing, forces the controller to read */

/* QSPIC_CTRLBUS Register */

#define QSPIC_QSPIC_DIS_CS                    (1U << 4) /* Write 1 to disable the chip select (active low) when the controller is in Manual */
#define QSPIC_QSPIC_EN_CS                     (1U << 3) /* Write 1 to enable the chip select (active low) when the controller is in Manual  */
#define QSPIC_QSPIC_SET_QUAD                  (1U << 2) /* Write 1 to set the bus mode in Quad mode when the controller is in Manual mode. */
#define QSPIC_QSPIC_SET_DUAL                  (1U << 1) /* Write 1 to set the bus mode in Dual mode when the controller is in Manual mode. */
#define QSPIC_QSPIC_SET_SINGLE                (1U << 0) /* Write 1 to set the bus mode in Single SPI mode when the controller is in Manual  */

/* QSPIC_CTRLMODE Register */

#define QSPIC_QSPIC_CLK_FREE_EN               (1U << 16) /* Controls the behavior of the QSPI_SCK when the QSPI_CS is high and the QSPIC_CS_ */
#define QSPIC_QSPIC_CS_MD                     (1U << 15) /* Controls the clock edge with which is produced the QSPI_CS signal. 0: The QSPI_C */
#define QSPIC_QSPIC_SRAM_EN                   (1U << 14) /* Defines the type of the external device that is connected on the QSPIC controlle */
#define QSPIC_QSPIC_USE_32BA                  (1U << 13) /* Controls the length of the address that the external memory device uses. 0: The  */
#define QSPIC_QSPIC_FORCENSEQ_EN              (1U << 12) /* Controls the way with which is addressed by the QSPI controller a burst request  */
#define QSPIC_QSPIC_PCLK_MD_MASK              (0x7 << 9) /* Controls the read pipe clock delay relative to the falling edge of QSPI_SCK. Ref */
#define QSPIC_QSPIC_PCLK_MD_POS               (9) /* Controls the read pipe clock delay relative to the falling edge of QSPI_SCK. Ref */
#define QSPIC_QSPIC_RPIPE_EN                  (1U << 8) /* Controls the use of the data read pipe. 0: The read pipe is disabled, the sampli */
#define QSPIC_QSPIC_RXD_NEG                   (1U << 7) /* Defines the clock edge that is used for the capturing of the received data, when */
#define QSPIC_QSPIC_HRDY_MD                   (1U << 6) /* This configuration bit is useful when the frequency of the QSPI clock is much lo */
#define QSPIC_QSPIC_IO3_DAT                   (1U << 5) /* The value of QSPI_IO3 pad if QSPI_IO3_OEN is 1 */
#define QSPIC_QSPIC_IO2_DAT                   (1U << 4) /* The value of QSPI_IO2 pad if QSPI_IO2_OEN is 1 */
#define QSPIC_QSPIC_IO3_OEN                   (1U << 3) /* QSPI_IO3 output enable. Use this only in SPI or Dual SPI mode to control /HOLD s */
#define QSPIC_QSPIC_IO2_OEN                   (1U << 2) /* QSPI_IO2 output enable. Use this only in SPI or Dual SPI mode to control /WP sig */
#define QSPIC_QSPIC_CLK_MD                    (1U << 1) /* Mode of the generated QSPI_SCK clock  0: Use Mode 0 for the QSPI_CLK. The QSPI_S */
#define QSPIC_QSPIC_AUTO_MD                   (1U << 0) /* Mode of operation 0: The Manual Mode is selected. 1: The Auto Mode is selected.  */

/* QSPIC_DUMMYDATA Register */

#define QSPIC_QSPIC_DUMMYDATA_MASK            (0xFFFFFFFF << 0) /* Writing to this register generates a number of clock pulses to the SPI bus. Duri */
#define QSPIC_QSPIC_DUMMYDATA_POS             (0) /* Writing to this register generates a number of clock pulses to the SPI bus. Duri */

/* QSPIC_ERASECMDA Register */

#define QSPIC_QSPIC_RES_INST_MASK             (0xFF << 24) /* The code value of the erase resume instruction */
#define QSPIC_QSPIC_RES_INST_POS              (24) /* The code value of the erase resume instruction */
#define QSPIC_QSPIC_SUS_INST_MASK             (0xFF << 16) /* The code value of the erase suspend instruction. */
#define QSPIC_QSPIC_SUS_INST_POS              (16) /* The code value of the erase suspend instruction. */
#define QSPIC_QSPIC_WEN_INST_MASK             (0xFF << 8) /* The code value of the write enable instruction. */
#define QSPIC_QSPIC_WEN_INST_POS              (8) /* The code value of the write enable instruction. */
#define QSPIC_QSPIC_ERS_INST_MASK             (0xFF << 0) /* The code value of the erase instruction. */
#define QSPIC_QSPIC_ERS_INST_POS              (0) /* The code value of the erase instruction. */

/* QSPIC_ERASECMDB Register */

#define QSPIC_QSPIC_RESSUS_DLY_MASK           (0x3F << 24) /* Defines a timer that counts the minimum allowed delay between an erase suspend c */
#define QSPIC_QSPIC_RESSUS_DLY_POS            (24) /* Defines a timer that counts the minimum allowed delay between an erase suspend c */
#define QSPIC_QSPIC_ERSRES_HLD_MASK           (0xF << 16) /* The controller must stay without flash memory reading requests for this number o */
#define QSPIC_QSPIC_ERSRES_HLD_POS            (16) /* The controller must stay without flash memory reading requests for this number o */
#define QSPIC_QSPIC_ERS_CS_HI_MASK            (0x1F << 10) /* After the execution of instructions: write enable, erase, erase suspend and eras */
#define QSPIC_QSPIC_ERS_CS_HI_POS             (10) /* After the execution of instructions: write enable, erase, erase suspend and eras */
#define QSPIC_QSPIC_EAD_TX_MD_MASK            (0x3 << 8) /* The mode of the SPI Bus during the address phase of the erase instruction 0x0: S */
#define QSPIC_QSPIC_EAD_TX_MD_POS             (8) /* The mode of the SPI Bus during the address phase of the erase instruction 0x0: S */
#define QSPIC_QSPIC_RES_TX_MD_MASK            (0x3 << 6) /* The mode of the SPI Bus during the transmission of the resume instruction 0x0: S */
#define QSPIC_QSPIC_RES_TX_MD_POS             (6) /* The mode of the SPI Bus during the transmission of the resume instruction 0x0: S */
#define QSPIC_QSPIC_SUS_TX_MD_MASK            (0x3 << 4) /* The mode of the SPI Bus during the transmission of the suspend instruction. 0x0: */
#define QSPIC_QSPIC_SUS_TX_MD_POS             (4) /* The mode of the SPI Bus during the transmission of the suspend instruction. 0x0: */
#define QSPIC_QSPIC_WEN_TX_MD_MASK            (0x3 << 2) /* The mode of the SPI Bus during the transmission of the write enable instruction. */
#define QSPIC_QSPIC_WEN_TX_MD_POS             (2) /* The mode of the SPI Bus during the transmission of the write enable instruction. */
#define QSPIC_QSPIC_ERS_TX_MD_MASK            (0x3 << 0) /* The mode of the SPI Bus during the instruction phase of the erase instruction 0x */
#define QSPIC_QSPIC_ERS_TX_MD_POS             (0) /* The mode of the SPI Bus during the instruction phase of the erase instruction 0x */

/* QSPIC_ERASECTRL Register */

