AlmAck/svdtonuttx/demo/h/da1470x_qspic.h
#define QSPIC_QSPIC_ERS_STATE_MASK            (0x7 << 25) /* It shows the progress of sector/block erasing (read only). 0x0: No Erase. 0x1: P */
#define QSPIC_QSPIC_ERS_STATE_POS             (25) /* It shows the progress of sector/block erasing (read only). 0x0: No Erase. 0x1: P */
#define QSPIC_QSPIC_ERASE_EN                  (1U << 24) /* This bit has meaning only when the external device is a serial FLASH (QSPIC_SRAM */
#define QSPIC_QSPIC_ERS_ADDR_MASK             (0xFFFFF << 4) /* Defines the address of the block/sector that is requested to be erased. If QSPIC */
#define QSPIC_QSPIC_ERS_ADDR_POS              (4) /* Defines the address of the block/sector that is requested to be erased. If QSPIC */

/* QSPIC_GP Register */

#define QSPIC_QSPIC_PADS_SLEW_MASK            (0x3 << 3) /* QSPI pads slew rate control. Indicative values under certain conditions: 0x0 : R */
#define QSPIC_QSPIC_PADS_SLEW_POS             (3) /* QSPI pads slew rate control. Indicative values under certain conditions: 0x0 : R */
#define QSPIC_QSPIC_PADS_DRV_MASK             (0x3 << 1) /* QSPI pads drive current 0x0 : 4 mA 0x1 : 8 mA 0x2 : 12 mA 0x3 : 16 mA */
#define QSPIC_QSPIC_PADS_DRV_POS              (1) /* QSPI pads drive current 0x0 : 4 mA 0x1 : 8 mA 0x2 : 12 mA 0x3 : 16 mA */

/* QSPIC_MEMBLEN Register */

#define QSPIC_QSPIC_T_CEM_CC_MASK             (0x3FF << 4) /* Defines the maximum allowed time tCEM for which the QSPIC_CS can stay active (QS */
#define QSPIC_QSPIC_T_CEM_CC_POS              (4) /* Defines the maximum allowed time tCEM for which the QSPIC_CS can stay active (QS */
#define QSPIC_QSPIC_T_CEM_EN                  (1U << 3) /* This bit enables the controlling of the maximum time tCEM for which the QSPI_CS  */
#define QSPIC_QSPIC_MEMBLEN_MASK              (0x7 << 0) /* In this register is defined the expected behavior of the external memory device  */
#define QSPIC_QSPIC_MEMBLEN_POS               (0) /* In this register is defined the expected behavior of the external memory device  */

/* QSPIC_READDATA Register */

#define QSPIC_QSPIC_READDATA_MASK             (0xFFFFFFFF << 0) /* A read access at this register generates a data transfer from the external memor */
#define QSPIC_QSPIC_READDATA_POS              (0) /* A read access at this register generates a data transfer from the external memor */

/* QSPIC_RECVDATA Register */

#define QSPIC_QSPIC_RECVDATA_MASK             (0xFFFFFFFF << 0) /* This register contains the received data when the QSPIC_READDATA_REG register is */
#define QSPIC_QSPIC_RECVDATA_POS              (0) /* This register contains the received data when the QSPIC_READDATA_REG register is */

/* QSPIC_STATUSCMD Register */

#define QSPIC_QSPIC_STSDLY_SEL                (1U << 22) /* Defines the timer which is used to count the delay that it has to wait before to */
#define QSPIC_QSPIC_RESSTS_DLY_MASK           (0x3F << 16) /* Defines a timer that counts the minimum required delay between the reading of th */
#define QSPIC_QSPIC_RESSTS_DLY_POS            (16) /* Defines a timer that counts the minimum required delay between the reading of th */
#define QSPIC_QSPIC_BUSY_VAL                  (1U << 15) /* Defines the value of the Busy bit which means that the flash is busy. 0: The fla */
#define QSPIC_QSPIC_BUSY_POS_MASK             (0x7 << 12) /* Defines the bit of the Flash status register which represents the Busy bit (0x7  */
#define QSPIC_QSPIC_BUSY_POS_POS              (12) /* Defines the bit of the Flash status register which represents the Busy bit (0x7  */
#define QSPIC_QSPIC_RSTAT_RX_MD_MASK          (0x3 << 10) /* The mode of the SPI Bus during the reception phase of the read status instructio */
#define QSPIC_QSPIC_RSTAT_RX_MD_POS           (10) /* The mode of the SPI Bus during the reception phase of the read status instructio */
#define QSPIC_QSPIC_RSTAT_TX_MD_MASK          (0x3 << 8) /* The mode of the SPI Bus during the instruction phase of the read status instruct */
#define QSPIC_QSPIC_RSTAT_TX_MD_POS           (8) /* The mode of the SPI Bus during the instruction phase of the read status instruct */
#define QSPIC_QSPIC_RSTAT_INST_MASK           (0xFF << 0) /* The code value of the read status instruction. It is transmitted during the inst */
#define QSPIC_QSPIC_RSTAT_INST_POS            (0) /* The code value of the read status instruction. It is transmitted during the inst */

/* QSPIC_STATUS Register */

#define QSPIC_QSPIC_BUSY                      (1U << 0) /* The status of the SPI Bus.  0: The SPI Bus is idle 1: The SPI Bus is active. Rea */

/* QSPIC_WRITEDATA Register */

#define QSPIC_QSPIC_WRITEDATA_MASK            (0xFFFFFFFF << 0) /* Writing to this register is generating a data transfer from the controller to th */
#define QSPIC_QSPIC_WRITEDATA_POS             (0) /* Writing to this register is generating a data transfer from the controller to th */

#endif /* __DA1470X_QSPIC_H */
